---
kind: method
id: M:Autodesk.Revit.DB.Outline.Scale(System.Double)
source: html/7f4644d9-6012-63f7-dff6-8ec4273aeb3b.htm
---
# Autodesk.Revit.DB.Outline.Scale Method

Scales the bounding box by given scale.

## Syntax (C#)
```csharp
public void Scale(
	double scale
)
```

## Parameters
- **scale** (`System.Double`) - The scale value. It should be greater than zero.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The scale is invalid.